/******************************************************************
结论：在printf中的语句优先执行语法语句，然后执行打印
	  若有多条类似语句（++、--），则只执行一遍
******************************************************************/
#include <stdio.h>

int main()
{
	int b = 3;
	int arr[] = {6, 7, 8, 9};
	int *ptr = arr;
	*(ptr ++) += 123;
	printf("*(ptr - 1) = %d\n", *(ptr - 1));	//129
	printf("*(ptr - 1) = %d, *ptr = %d, *(++ ptr) = %d\n", *(ptr - 1), *ptr, *(++ ptr));
	printf("*(ptr - 1) = %d, *ptr = %d, *(++ ptr) = %d\n", *(ptr - 1), *ptr, *(++ ptr));

	return 0;
}